
// প্রশ্ন:

// একটি C প্রোগ্রাম লিখুন যা একটি ফাংশন ব্যবহার করে 1 থেকে 
// n (যেখানে n হলো ইনপুট সংখ্যা, উদাহরণস্বরূপ 14) পর্যন্ত সংখ্যাগুলো
//  ক্রমবর্ধমান ক্রমে (ascending order) প্রিন্ট করবে। ফাংশনটি রিকার্সন (recursion)
//   ব্যবহার করবে এবং প্রতিটি সংখ্যা আলাদা লাইনে প্রিন্ট করতে হবে। যদি ইনপুট সংখ্যা 0 
//   হয়, তবে ফাংশনটি কিছু প্রিন্ট না করে ফিরে আসবে।


#include <stdio.h>
 
 void printNum(int n);
int main() {
     printNum(14);
    return 0;
}
 void printNum(int n){
    if(n==0)
    {
        return;
    }
    printNum(n-1);
    printf("%d \n",n);
 }